/*4) Даны 3 целых числа. Найти количество положительных чисел в исходном наборе.
 */
public class Task12 {
    public static void main(String[] args) {
        int x=2, y=4;
        if (x>y) {
            System.out.println("2  больше 4");
        } else {
            System.out.println("4 больше 2");

        }

    }
}
